export interface NewsContent {
    type: 'header' | 'paragraph' | 'image';
    value: string;
}


export interface NewsArticle {
  id: string;
  title: string;
  summary: string;
  date: string;
  mainImage: string;
  content?: NewsContent[];
  galleryImages?: string[];
}

export const allNews: NewsArticle[] = [
  {
    id: '1',
    title: 'رونمایی از محصول جدید آکوافیدپلاس در نمایشگاه دام، طیور و آبزیان اهواز',
    summary: 'شرکت Aquafeed Plus از محصول جدید خود برای مزارع پرورش میگو رونمایی کرد.',
    date: '1403/09/09',
    mainImage: 'https://aquafeedplus.org/wp-content/uploads/2025/03/1002922a-8d1d-4aee-8a66-12dd064425c4-300x151-1.jpg',
    galleryImages: ['https://aquafeedplus.org/wp-content/uploads/2025/03/1002922a-8d1d-4aee-8a66-12dd064425c4-300x151-1.jpg'],
    content: [
        { 
            type: 'paragraph',
            value: 'به گزارش روابط عمومی آکوافید پلاس، ناصر خیامی، مدیر فروش آکوافیدپلاس، در گفت‌وگو با خبرنگار فارس اظهار داشت:'
        },
        { 
            type: 'paragraph',
            value: '“در پاسخ به نیاز روزافزون بازار به خوراک باکیفیت آبزیان، محصولی منحصر به فرد تولید کرده‌ایم که سلامت آبزیان و بهره‌وری مزارع پرورشی را به طور چشمگیری افزایش می‌دهد.”'
        },
        { 
            type: 'header',
            value: 'ویژگی‌های کلیدی محصول جدید:'
        },
        { 
            type: 'paragraph',
            value: 'فرمولاسیون اختصاصی برای بهبود رشد و ایمنی آبزیان'
        },
        { 
            type: 'paragraph',
            value: 'استفاده از مواد اولیه با کیفیت تحت نظارت کارشناسان مجرب'
        },
        { 
            type: 'paragraph',
            value: 'قیمت رقابتی در مقایسه با محصولات مشابه خارجی'
        },
        { 
            type: 'header',
            value: 'دستاوردهای قابل توجه:'
        },
        { 
            type: 'paragraph',
            value: 'صادرات به کشورهای اوراسیایی و حاشیه خلیج فارس'
        },
        { 
            type: 'paragraph',
            value: 'طراحی بسته‌بندی چندزبانه (فارسی، انگلیسی، عربی و روسی)'
        },
        { 
            type: 'paragraph',
            value: 'ایجاد اشتغال برای ۸۰ نیروی متخصص'
        },
        { 
            type: 'paragraph',
            value: 'برنامه‌ریزی برای راه‌اندازی شبکه نمایندگی در تمام استان‌ها تا نیمه نخست ۱۴۰۴'
        },
        { 
            type: 'paragraph',
            value: 'محمدحسین نقاش‌نژاد، پرورش‌دهنده نمونه کشوری از مجتمع پرورش ماهی کارون شوشتر، با تأیید کیفیت محصولات آکوافیدپلاس گفت:'
        },
        { 
            type: 'paragraph',
            value: '“با تولیداتی با این کیفیت، دیگر نیازی به محصولات خارجی احساس نمی‌کنیم. در سال جاری از ۱۲۰۰ تن محصول این کارخانه استفاده کرده‌ایم و پیش‌بینی می‌کنیم این مقدار در سال آینده به ۱۵۰۰ تن افزایش یابد.”'
        },
    ],
  },
  {
    id: '2',
    title: 'رونمایی از محصول جدید آکوافیدپلاس در نمایشگاه دام، طیور و آبزیان اهواز',
    summary: 'شرکت Aquafeed Plus از محصول جدید خود برای مزارع پرورش میگو رونمایی کرد.',
    date: '1403/09/09',
    mainImage: 'https://aquafeedplus.org/wp-content/uploads/2025/03/1002922a-8d1d-4aee-8a66-12dd064425c4-300x151-1.jpg',
    galleryImages: [''],
    content: [
        { 
            type: 'paragraph',
            value: 'به گزارش روابط عمومی آکوافید پلاس، ناصر خیامی، مدیر فروش آکوافیدپلاس، در گفت‌وگو با خبرنگار فارس اظهار داشت:'
        },
        { 
            type: 'paragraph',
            value: '“در پاسخ به نیاز روزافزون بازار به خوراک باکیفیت آبزیان، محصولی منحصر به فرد تولید کرده‌ایم که سلامت آبزیان و بهره‌وری مزارع پرورشی را به طور چشمگیری افزایش می‌دهد.”'
        },
        { 
            type: 'header',
            value: 'ویژگی‌های کلیدی محصول جدید:'
        },
        { 
            type: 'paragraph',
            value: 'فرمولاسیون اختصاصی برای بهبود رشد و ایمنی آبزیان'
        },
        { 
            type: 'paragraph',
            value: 'استفاده از مواد اولیه با کیفیت تحت نظارت کارشناسان مجرب'
        },
        { 
            type: 'paragraph',
            value: 'قیمت رقابتی در مقایسه با محصولات مشابه خارجی'
        },
        { 
            type: 'header',
            value: 'دستاوردهای قابل توجه:'
        },
        { 
            type: 'paragraph',
            value: 'صادرات به کشورهای اوراسیایی و حاشیه خلیج فارس'
        },
        { 
            type: 'paragraph',
            value: 'طراحی بسته‌بندی چندزبانه (فارسی، انگلیسی، عربی و روسی)'
        },
        { 
            type: 'paragraph',
            value: 'ایجاد اشتغال برای ۸۰ نیروی متخصص'
        },
        { 
            type: 'paragraph',
            value: 'برنامه‌ریزی برای راه‌اندازی شبکه نمایندگی در تمام استان‌ها تا نیمه نخست ۱۴۰۴'
        },
        { 
            type: 'paragraph',
            value: 'محمدحسین نقاش‌نژاد، پرورش‌دهنده نمونه کشوری از مجتمع پرورش ماهی کارون شوشتر، با تأیید کیفیت محصولات آکوافیدپلاس گفت:'
        },
        { 
            type: 'paragraph',
            value: '“با تولیداتی با این کیفیت، دیگر نیازی به محصولات خارجی احساس نمی‌کنیم. در سال جاری از ۱۲۰۰ تن محصول این کارخانه استفاده کرده‌ایم و پیش‌بینی می‌کنیم این مقدار در سال آینده به ۱۵۰۰ تن افزایش یابد.”'
        },
    ],
  },
  {
    id: '3',
    title: 'رونمایی از محصول جدید آکوافیدپلاس در نمایشگاه دام، طیور و آبزیان اهواز',
    summary: 'شرکت Aquafeed Plus از محصول جدید خود برای مزارع پرورش میگو رونمایی کرد.',
    date: '1403/09/09',
    mainImage: 'https://aquafeedplus.org/wp-content/uploads/2025/03/1002922a-8d1d-4aee-8a66-12dd064425c4-300x151-1.jpg',
    galleryImages: [''],
    content: [
        { 
            type: 'paragraph',
            value: 'به گزارش روابط عمومی آکوافید پلاس، ناصر خیامی، مدیر فروش آکوافیدپلاس، در گفت‌وگو با خبرنگار فارس اظهار داشت:'
        },
        { 
            type: 'paragraph',
            value: '“در پاسخ به نیاز روزافزون بازار به خوراک باکیفیت آبزیان، محصولی منحصر به فرد تولید کرده‌ایم که سلامت آبزیان و بهره‌وری مزارع پرورشی را به طور چشمگیری افزایش می‌دهد.”'
        },
        { 
            type: 'header',
            value: 'ویژگی‌های کلیدی محصول جدید:'
        },
        { 
            type: 'paragraph',
            value: 'فرمولاسیون اختصاصی برای بهبود رشد و ایمنی آبزیان'
        },
        { 
            type: 'paragraph',
            value: 'استفاده از مواد اولیه با کیفیت تحت نظارت کارشناسان مجرب'
        },
        { 
            type: 'paragraph',
            value: 'قیمت رقابتی در مقایسه با محصولات مشابه خارجی'
        },
        { 
            type: 'header',
            value: 'دستاوردهای قابل توجه:'
        },
        { 
            type: 'paragraph',
            value: 'صادرات به کشورهای اوراسیایی و حاشیه خلیج فارس'
        },
        { 
            type: 'paragraph',
            value: 'طراحی بسته‌بندی چندزبانه (فارسی، انگلیسی، عربی و روسی)'
        },
        { 
            type: 'paragraph',
            value: 'ایجاد اشتغال برای ۸۰ نیروی متخصص'
        },
        { 
            type: 'paragraph',
            value: 'برنامه‌ریزی برای راه‌اندازی شبکه نمایندگی در تمام استان‌ها تا نیمه نخست ۱۴۰۴'
        },
        { 
            type: 'paragraph',
            value: 'محمدحسین نقاش‌نژاد، پرورش‌دهنده نمونه کشوری از مجتمع پرورش ماهی کارون شوشتر، با تأیید کیفیت محصولات آکوافیدپلاس گفت:'
        },
        { 
            type: 'paragraph',
            value: '“با تولیداتی با این کیفیت، دیگر نیازی به محصولات خارجی احساس نمی‌کنیم. در سال جاری از ۱۲۰۰ تن محصول این کارخانه استفاده کرده‌ایم و پیش‌بینی می‌کنیم این مقدار در سال آینده به ۱۵۰۰ تن افزایش یابد.”'
        },
    ],
  },
  {
    id: '4',
    title: 'رونمایی از محصول جدید آکوافیدپلاس در نمایشگاه دام، طیور و آبزیان اهواز',
    summary: 'شرکت Aquafeed Plus از محصول جدید خود برای مزارع پرورش میگو رونمایی کرد.',
    date: '1403/09/09',
    mainImage: 'https://aquafeedplus.org/wp-content/uploads/2025/03/1002922a-8d1d-4aee-8a66-12dd064425c4-300x151-1.jpg',
    galleryImages: [''],
    content: [
        { 
            type: 'paragraph',
            value: 'به گزارش روابط عمومی آکوافید پلاس، ناصر خیامی، مدیر فروش آکوافیدپلاس، در گفت‌وگو با خبرنگار فارس اظهار داشت:'
        },
        { 
            type: 'paragraph',
            value: '“در پاسخ به نیاز روزافزون بازار به خوراک باکیفیت آبزیان، محصولی منحصر به فرد تولید کرده‌ایم که سلامت آبزیان و بهره‌وری مزارع پرورشی را به طور چشمگیری افزایش می‌دهد.”'
        },
        { 
            type: 'header',
            value: 'ویژگی‌های کلیدی محصول جدید:'
        },
        { 
            type: 'paragraph',
            value: 'فرمولاسیون اختصاصی برای بهبود رشد و ایمنی آبزیان'
        },
        { 
            type: 'paragraph',
            value: 'استفاده از مواد اولیه با کیفیت تحت نظارت کارشناسان مجرب'
        },
        { 
            type: 'paragraph',
            value: 'قیمت رقابتی در مقایسه با محصولات مشابه خارجی'
        },
        { 
            type: 'header',
            value: 'دستاوردهای قابل توجه:'
        },
        { 
            type: 'paragraph',
            value: 'صادرات به کشورهای اوراسیایی و حاشیه خلیج فارس'
        },
        { 
            type: 'paragraph',
            value: 'طراحی بسته‌بندی چندزبانه (فارسی، انگلیسی، عربی و روسی)'
        },
        { 
            type: 'paragraph',
            value: 'ایجاد اشتغال برای ۸۰ نیروی متخصص'
        },
        { 
            type: 'paragraph',
            value: 'برنامه‌ریزی برای راه‌اندازی شبکه نمایندگی در تمام استان‌ها تا نیمه نخست ۱۴۰۴'
        },
        { 
            type: 'paragraph',
            value: 'محمدحسین نقاش‌نژاد، پرورش‌دهنده نمونه کشوری از مجتمع پرورش ماهی کارون شوشتر، با تأیید کیفیت محصولات آکوافیدپلاس گفت:'
        },
        { 
            type: 'paragraph',
            value: '“با تولیداتی با این کیفیت، دیگر نیازی به محصولات خارجی احساس نمی‌کنیم. در سال جاری از ۱۲۰۰ تن محصول این کارخانه استفاده کرده‌ایم و پیش‌بینی می‌کنیم این مقدار در سال آینده به ۱۵۰۰ تن افزایش یابد.”'
        },
    ],
  },
  {
    id: '5',
    title: 'رونمایی از محصول جدید آکوافیدپلاس در نمایشگاه دام، طیور و آبزیان اهواز',
    summary: 'شرکت Aquafeed Plus از محصول جدید خود برای مزارع پرورش میگو رونمایی کرد.',
    date: '1403/09/09',
    mainImage: 'https://aquafeedplus.org/wp-content/uploads/2025/03/1002922a-8d1d-4aee-8a66-12dd064425c4-300x151-1.jpg',
    galleryImages: [''],
    content: [
        { 
            type: 'paragraph',
            value: 'به گزارش روابط عمومی آکوافید پلاس، ناصر خیامی، مدیر فروش آکوافیدپلاس، در گفت‌وگو با خبرنگار فارس اظهار داشت:'
        },
        { 
            type: 'paragraph',
            value: '“در پاسخ به نیاز روزافزون بازار به خوراک باکیفیت آبزیان، محصولی منحصر به فرد تولید کرده‌ایم که سلامت آبزیان و بهره‌وری مزارع پرورشی را به طور چشمگیری افزایش می‌دهد.”'
        },
        { 
            type: 'header',
            value: 'ویژگی‌های کلیدی محصول جدید:'
        },
        { 
            type: 'paragraph',
            value: 'فرمولاسیون اختصاصی برای بهبود رشد و ایمنی آبزیان'
        },
        { 
            type: 'paragraph',
            value: 'استفاده از مواد اولیه با کیفیت تحت نظارت کارشناسان مجرب'
        },
        { 
            type: 'paragraph',
            value: 'قیمت رقابتی در مقایسه با محصولات مشابه خارجی'
        },
        { 
            type: 'header',
            value: 'دستاوردهای قابل توجه:'
        },
        { 
            type: 'paragraph',
            value: 'صادرات به کشورهای اوراسیایی و حاشیه خلیج فارس'
        },
        { 
            type: 'paragraph',
            value: 'طراحی بسته‌بندی چندزبانه (فارسی، انگلیسی، عربی و روسی)'
        },
        { 
            type: 'paragraph',
            value: 'ایجاد اشتغال برای ۸۰ نیروی متخصص'
        },
        { 
            type: 'paragraph',
            value: 'برنامه‌ریزی برای راه‌اندازی شبکه نمایندگی در تمام استان‌ها تا نیمه نخست ۱۴۰۴'
        },
        { 
            type: 'paragraph',
            value: 'محمدحسین نقاش‌نژاد، پرورش‌دهنده نمونه کشوری از مجتمع پرورش ماهی کارون شوشتر، با تأیید کیفیت محصولات آکوافیدپلاس گفت:'
        },
        { 
            type: 'paragraph',
            value: '“با تولیداتی با این کیفیت، دیگر نیازی به محصولات خارجی احساس نمی‌کنیم. در سال جاری از ۱۲۰۰ تن محصول این کارخانه استفاده کرده‌ایم و پیش‌بینی می‌کنیم این مقدار در سال آینده به ۱۵۰۰ تن افزایش یابد.”'
        },
    ],
  },
];